app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "content", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["name", "Brybz"], ["content", "hahahahaha"], ["created_at", "2019-05-30 18:03:29.577262"], ["updated_at", "2019-05-30 18:03:29.577262"], ["post_id", 9]]
---
    def create
        @post  = Post.find(params[:post_id])
        @comment = @post.comments.create(params[:comment].permit(:name, :content))